<!--
 * @Author: 郑钊宇
 * @Date: 2022-03-08 09:04:07
 * @LastEditTime: 2022-03-08 09:15:44
 * @LastEditors: 郑钊宇
 * @Description: 图书馆概况
-->
<template>
  <div>
    <TemplePage :detailTittle="detailTittle">
      <template #breadcrumb>
        <el-breadcrumb separator-class="el-icon-arrow-right">
          <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
          <el-breadcrumb-item :to="{ path: '/introduction' }">
            {{ detailTittle }}
          </el-breadcrumb-item>
        </el-breadcrumb>
      </template>
      <template #text>
        <p>
          河北地质大学图书馆创建于1954年，1987年随学校由河北宣化迁至省会石家庄。图书馆始终以学校发展相依存，先后经历了中专创建（1954～1965，宣化地质学校时期）、文革停滞
          （1966～1970）、大学恢复（1971～1982，1971年升格为河北地质学院）和党的十一届三中全会以后的迅速发展等四个时期。经过近60年的发展，现已建成集借书、阅览、网络查询、数字视听、联机检索为一体的多功能新型图书馆。总建筑面积2.78万平方米，由校本部馆和北校区分馆组成。图书馆下设15个纸质文献专业阅览室，1个电子阅览室，1个密集书库，3个捐赠书屋，3个教师研修室，9个自习室，1个会议室，3206个阅览座位。截止到2018年10月，图书馆共有纸质图书154万册、地质资料3万余种，可访问电子数据库47个，可获取的电子期刊7000种以上，可阅览的电子图书345万种。
        </p>
        <p>
          进入新世纪后，随着学校办学水平的持续提高和办学规模的不断扩大，图书馆也获得了空前发展机遇，以服务学校教学和科研为使命，馆藏建设始终紧密围绕学校“地经渗透、工管结合”的办学特色，形成了以地学、经济和管理类书、刊、报文献为主藏，兼顾其他学科专业的馆藏体系，基本实现了学校现有学科专业文献资源全覆盖。特别是地学类和经济管理类图书的馆藏较为全面，馆藏特色明显，契合学科专业发展需要。
        </p>
        <p>
          根据学校教学与科研需要，订购的中外文数据库有CNKI、超星、Wiley、中外文电子图书等多个数据库。在长期的办馆实践中逐步提炼形成了“读者第一，服务至上，以人为本，管理创新”的办馆宗旨。读者服务工作是图书馆一切工作的出发点和落脚点，在学校组织的历次服务部门满意度测评中均取得骄人成绩。实现了日开馆14小时，周开馆98小时的目标。读者服务实行“借阅咨一体化”服务模式。电子资源的全天候服务使图书馆成为名副其实不受地理位置限制的“没有围墙的图书馆”。
        </p>
        <p>
          为加强读者教育，提升学生信息素质，图书馆面向全校学生开设“文献检索”选修课，开展经常性学术讲座和大型数据库讲座。每年新生入学后，图书馆派专人对新生进行入馆教育。图书馆每年还组织知识竞赛、演讲比赛、中国传统文化比赛等形式多样的阅读推广和文化传播活动，致力于提高学生的文化素质，增强学校的文化氛围。
        </p>
        <p>
          为加强图书馆对科研工作的支持力度，提升工作人员对科研成果的贡献率，近年来不断完善学科馆员制度，对重点学科进行跟踪服务，对重点研究人员提供点对点服务。图书馆是“中国高等教育文献保障系统”（CALIS）、“中国高校人文社会科学文献中心”（CASHL）、“大学数字图书馆国际合作计划”（CADAL）、“国家科技图书文献中心”（NSTL）、中国地质图书馆等组织成员馆，通过成员馆之间文献共建共享合作，为师生提供文献传递、馆际互借、远程访问，为学校教学科研提供了坚实的文献信息资源保障。另外还开通了河北地质大学教师学科服务QQ群，为老师提供文献传递服务。
        </p>
        <p>
          今后，图书馆将会紧密依托本馆馆员大多来自不同专业背景的综合性人才优势，充分调动馆内雄厚的智力资源，与丰富的馆藏资源相结合，辅以现代信息技术，加大文献信息资源的整合力度，提升读者服务工作中的知识含量，提供更具专业性、针对性、个性化的读者服务，使图书馆成为数字化时代用户获取信息和自我学习不可或缺的重要支撑。
        </p>
      </template>

      <!-- {{ $route.params.newsId }} -->
    </TemplePage>
  </div>
</template>

<script>
import TemplePage from "../components/DetailTemplePage.vue";
export default {
  components: { TemplePage },
  data() {
    return {
      detailTittle: "本馆概况"
    };
  }
};
</script>

<style></style>
