<!--
 * @Author: 郑钊宇
 * @Date: 2022-03-06 19:11:53
 * @LastEditTime: 2022-03-15 19:53:15
 * @LastEditors: 郑钊宇
 * @Description: 新闻公告页面
-->
<template>
  <div>
    <TemplePage
      :header-tittle="headerTittle"
      :detail-tittle="detailTittle"
      :date-tittle="dateTittle"
    >
      <template #breadcrumb>
        <el-breadcrumb separator-class="el-icon-arrow-right">
          <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
          <el-breadcrumb-item :to="{ path: '/announcement' }">
            新闻公告
          </el-breadcrumb-item>
          <el-breadcrumb-item>{{ detailTittle }}</el-breadcrumb-item>
        </el-breadcrumb>
      </template>
      <template #text>
        <p>
          'asdasdasjdghalsdhasjlkd' "12314551"
          这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘
        </p>
        <img :src="headerImage" alt="测试用">
        <p>
          这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘
        </p>
        <p>
          这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘这是一段测试用文稿《测试用》，！？；’”“‘
        </p>
        <p class="signature">河北地质大学图书馆</p>
      </template>

      <!-- {{ $route.params.newsId }} -->
    </TemplePage>
  </div>
</template>

<script>
import TemplePage from '../components/DetailTemplePage.vue'
export default {
  name: 'News',
  data() {
    return {
      headerTittle: '新闻|公告',
      detailTittle: '一段测试文字一段测试文字一段测试文字',
      dateTittle: '2022/03/05'
    }
  },
  props: {
    headerImage: {
      type: String,
      default: require('@/assets/img/header.jpg')
    }
  },
  components: {
    TemplePage
  }
}
</script>

<style></style>
